app/controllers/email_controller.rb

SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`email`) = BINARY 'lalo.moreno86@gmail.com' AND `users`.id <> 2) LIMIT 1
---
  def remind
    @title = "Enviar mi informaci&oacute;n"
    if param_posted?(:user)
      email = params[:user][:email]
      user = User.find_by_email(email)