app/controllers/leagues_controller.rb

  def show
    @league = League.find_by_leaguesubdomain(current_subdomain)
---
SELECT * FROM `leagues` WHERE (`leagues`.`leaguesubdomain` = 'mexicana') LIMIT 1

  def edit
    @league = League.find(params[:id])
---
SELECT * FROM `leagues` WHERE (`leagues`.`id` = 1)

  def create
		@league = @current_user.leagues.build(params[:league])

    respond_to do |format|
      if @league.save
---
INSERT INTO `leagues` (`leaguesubdomain`, `created_at`, `updated_at`, `leaguename`, `userid`) VALUES('decabello', '2009-09-29 03:14:14', '2009-09-29 03:14:14', 'De Cabello', NULL)