app/controllers/leagues_controller.rb

  def show
    @league = League.find(params[:id])
---
SELECT * FROM `leagues` WHERE (`leagues`.`id` = 1)