app/controllers/matches_controller.rb

  def index
    @matches = Match.all
---
SELECT * FROM `matches`

  def show
    @match = Match.find(params[:id])
---
SELECT * FROM `matches` WHERE (`matches`.`id` = 1)

  def edit
    @match = Match.find(params[:id])
---
SELECT * FROM `matches` WHERE (`matches`.`id` = 3)

  def create
    @match = Match.new(params[:match])

    respond_to do |format|
      if @match.save
---
INSERT INTO `matches` (`localteam`, `created_at`, `updated_at`, `matchtime`, `week_id`, `visitteam`, `matchdate`) VALUES(6, '2009-10-09 18:08:21', '2009-10-09 18:08:21', '2009-10-09 17:58:00', 1, NULL, '2009-10-09')

  def destroy
    @match = Match.find(params[:id])
    @match.destroy
---
SELECT * FROM `matches` WHERE (`matches`.`id` = 1)
DELETE FROM `matches` WHERE `id` = 1