app/controllers/players_controller.rb

  def index
    @players = Player.all
---
SELECT * FROM `players`

  def show
    @player = Player.find(params[:id])
---
SELECT * FROM `players` WHERE (`players`.`id` = 1)

  def create
    @player = Player.new(params[:player])

    respond_to do |format|
      if @player.save
---
INSERT INTO `players` (`created_at`, `playerphonenumber`, `updated_at`, `playername`, `team_id`, `playeremail`) VALUES('2009-10-01 23:42:45', 8112558677, '2009-10-01 23:42:45', 'Eduardo Moreno', 5, 'lalo.moreno86@gmail.com')