app/controllers/teams_controller.rb

SELECT * FROM `teams` WHERE (`teams`.league_id = 1 AND (teamname LIKE '%%'))
---
  def index
    @teams = Team.all

SELECT * FROM `teams` WHERE (`teams`.`id` = 7 AND (`teams`.league_id = 1))
---
  def show
    @team = Team.find(params[:id])

SELECT * FROM `teams` WHERE (`teams`.`id` = 6)
---
  def edit
    @team = Team.find(params[:id])

INSERT INTO `teams` (`league_id`, `teamname`, `created_at`, `updated_at`) VALUES(NULL, 'Triple A', '2009-09-30 23:17:13', '2009-09-30 23:17:13')
---
  def create
    @team = Team.new(params[:team])

    respond_to do |format|
      if @team.save

SELECT * FROM `teams` WHERE (`teams`.`id` = 3)
DELETE FROM `teams` WHERE `id` = 3
---
  def destroy
    @team = Team.find(params[:id])
    @team.destroy