app/controllers/tournaments_controller.rb

SELECT * FROM `tournaments`
---
  def index
    @tournaments = Tournament.all

SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)
---
  def show
    @tournament = Tournament.find(params[:id])

SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 2)
---
  def edit
    @tournament = Tournament.find(params[:id])

INSERT INTO `tournaments` (`league_id`, `created_at`, `tournamentname`, `enddate`, `updated_at`, `startdate`) VALUES(NULL, '2009-10-01 19:58:22', 'De Apertura', '2009-12-09', '2009-10-01 19:58:22', '2009-10-01')
---
  def create
    @tournament = Tournament.new(params[:tournament])

    respond_to do |format|
      if @tournament.save

SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)
DELETE FROM `tournaments` WHERE `id` = 1
---
  def destroy
    @tournament = Tournament.find(params[:id])
    @tournament.destroy