app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `lastname`, `remember_token`, `email`) VALUES('Magnolia', '665d41b6a76907298dbe370451a917c040737394', '2009-09-28 01:26:51', NULL, '66a89df7a11015a259f4de927619246a5edcbe56', NULL, '2009-09-28 01:26:51', '4d36d73453c46fc871b6b56780c7e98be7eae372', NULL, NULL, 'magno.gutierrez@gmail.com')
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save

SELECT * FROM `users` WHERE (`users`.`activation_code` = '78502c1dc95d996f54016bc5a877a3b0360dcb7a') LIMIT 1
---
  def activate
    self.current_user = params[:activation_code].blank? ? false : User.find_by_activation_code(params[:activation_code])