app/controllers/weeks_controller.rb

SELECT * FROM `weeks`
---
  def index
    @weeks = Week.all

SELECT * FROM `weeks` WHERE (`weeks`.`id` = 1)
---
  def show
    @week = Week.find(params[:id])

INSERT INTO `weeks` (`created_at`, `enddate`, `updated_at`, `tournament_id`, `startdate`) VALUES('2009-10-01 23:35:40', '2009-11-01', '2009-10-01 23:35:40', 2, '2009-10-01')
---
  def create
    @week = Week.new(params[:week])

    respond_to do |format|
      if @week.save